content/posts-org/hops.org
#+hugo_base_dir: ../../
# -*- mode: org; coding: utf-8; -*-
* Header Information                                               :noexport:
#+LaTeX_CLASS_OPTIONS: [11pt]
#+LATEX_HEADER: \usepackage{helvetica}
#+LATEX_HEADER: \setlength{\textwidth}{5.1in} % set width of text portion
#+LATEX_HEADER: \usepackage{geometry}
#+TITLE:     hops tips
#+AUTHOR:    Fei Ni
#+EMAIL:     feiphilips.ni@veritas.com
#+DATE:      2021-02-22
#+HUGO_CATEGORIES:
#+HUGO_tags: helix
#+hugo_auto_set_lastmod: t
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS:   ^:{}
#+INFOJS_OPT: view:nil toc:nil ltoc:nil mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+HTML_HEAD: <link rel="stylesheet" href="org.css" type="text/css"/>
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:

#+STARTUP: hidestars

#+STARTUP: overview   (or: showall, content, showeverything)
http://orgmode.org/org.html#Visibility-cycling  info:org#Visibility cycling

#+TODO: TODO(t) NEXT(n) STARTED(s) WAITING(w@/!) SOMEDAY(S!) | DONE(d!/!) CANCELLED(c@/!)
http://orgmode.org/org.html#Per_002dfile-keywords  info:org#Per-file keywords

#+TAGS: important(i) private(p)
#+TAGS: @HOME(h) @OFFICE(o)
http://orgmode.org/org.html#Setting-tags  info:org#Setting tags

#+NOstartup: beamer
#+NOLaTeX_CLASS: beamer
#+NOLaTeX_CLASS_OPTIONS: [bigger]
#+NOBEAMER_FRAME_LEVEL: 2


# Start from here


* create secrets between 2 services
  - hops secret rotate-internal-service -e test -s foo -t bar
#+begin_src bash
  Yea, it’s a bit of a weird name.. but this is what it’s supposed to do under the hood.

1. Create a secret (usually something like IS-XXX)
2. hops secret add -e <environment> -s <service1> -p internal-service/<service2>/api-key/apiKey
3. hops secret add -e <environment> -s <service2> -p internal-service/<service1>/api-key/apiKey


#+end_src

and to verify with this way:
#+begin_src bash
[fei.ni@fei-ni-C02D72XMMD6N-SM hipaa-staging download (feature/GENP-1139 *%)]$ hops secret rotate-internal-service -e hipaa-staging -s salesforce -t report
Secret rotated successfully.
  [fei.ni@fei-ni-C02D72XMMD6N-SM hipaa-staging download (feature/GENP-1139 *%)]$ hops secret get -e hipaa-staging -s salesforce -p internal-service/report/api-key/apiKey
  IS-NM6BKUV7QIG5SD4Z5PYLQ2KCLG2R3TOH
  [fei.ni@fei-ni-C02D72XMMD6N-SM hipaa-staging download (feature/GENP-1139 *%)]$ hops secret get -e hipaa-staging -s report -p internal-service/salesforce/api-key/apiKey
  IS-NM6BKUV7QIG5SD4Z5PYLQ2KCLG2R3TOH
#+end_src


* Use hops to access DB
  #+begin_src bash
    [fei.ni@fei-ni-C02D72XMMD6N-SM master myhelix]$ hops db config -f eval -e staging -s mapping
    Loaded  secrets  from parameter store with subkeys:  part-1
    LOCAL_PORT=$(python -c 'import socket; s=socket.socket(); s.bind(("", 0)); print(s.getsockname()[1]); s.close()')
    ssh -f -o ExitOnForwardFailure=yes -L $LOCAL_PORT:ue1-staging-mapping-007-cluster.cluster-crbiutp3k1kf.us-east-1.rds.amazonaws.com:3306 fei.ni@172.19.69.18 sleep 60 && \
    MYSQL_PWD='2vNv3hkWqaqwqb' mysql mapping --host=127.0.0.1 --port=${LOCAL_PORT} --user='mapping-service'

    Notice: to replace host with the aws hostname, and replace the port with 3306

    [fei.ni@fei-ni-C02D72XMMD6N-SM master myhelix]$ MYSQL_PWD='2vNv3hkWqaqwqb' mysql mapping --host=ue1-staging-mapping-007-cluster.cluster-crbiutp3k1kf.us-east-1.rds.amazonaws.com --port=3306 --user='mapping-service'
    Reading table information for completion of table and column names
    You can turn off this feature to get a quicker startup with -A

    Welcome to the MySQL monitor.  Commands end with ; or \g.
    Your MySQL connection id is 136276
    Server version: 5.6.10 MySQL Community Server (GPL)

    Copyright (c) 2000, 2021, Oracle and/or its affiliates.

    Oracle is a registered trademark of Oracle Corporation and/or its
    affiliates. Other names may be trademarks of their respective
    owners.

    Type 'help;' or '\h' for help. Type '\c' to clear the current input statement.

    mysql> \
  #+end_src
* DB tips

| Action            | mysql Command         | postgresql Command |
|-------------------+-----------------------+--------------------|
| list dbs          | show databases        |                    |
| switch db         | use <db_name>         |                    |
| list tables       | show tables           | \dt                |
| show table schema | describe <table_name> | \d <table_name>    |

* Links
  - https://myhelix.atlassian.net/wiki/spaces/ENG/pages/777420817/Managing+Serialized+Secrets+in+Parameter+Store
